Repository: netgiro/woocommerce-plugin
Catalog: languages/netgiro-payment-gateway-for-woocommerce-*.po
Languages: is

source: Netgíró Payment Gateway for WooCommerce
is: Netgíró greiðslugátt fyrir WooCommerce

source: Official Netgíró Payment Gateway integration for WooCommerce.
is: Opinber Netgíró greiðslugátt samþætting fyrir WooCommerce.

source: Check Netgíró status
is: Athuga stöðu Netgíró

source: No Netgíró transaction ID found for this order.
is: Ekkert færslunúmer frá Netgíró fannst fyrir þessa pöntun.

source: Order was not paid using Netgíró. Status check aborted.
is: Pöntunin var ekki greidd með Netgíró. Hætt við stöðuathugun.

source: Netgíró gateway instance not found or not active.
is: Tilvik Netgíró greiðslugáttar fannst ekki eða er ekki virkt.

source: Netgíró API credentials (Secret Key or Application ID) are not configured in WooCommerce settings.
is: API aðgangsupplýsingar fyrir Netgíró (Leynilykill eða Auðkennisnúmer forrits) eru ekki stilltar í WooCommerce stillingum.

source: Netgíró API class not found. Plugin files may be missing or corrupted.
is: Netgíró API klasinn fannst ekki. Hugsanlegt er að skrár viðbótarinnar vanti eða séu skemmdar.

source: Netgíró status check failed: %1$s (Transaction ID: %2$s)
is: Athugun á stöðu Netgíró mistókst: %1$s (Færslunúmer: %2$s)

source: Status not provided
is: Staða ekki gefin upp

source: Refundable
is: Endurgreiðanlegt

source: Not Refundable
is: Ekki endurgreiðanlegt

source: Settlement expected on: %s
is: Gert er ráð fyrir uppgjöri þann: %s

source: Settlement date not available
is: Uppgjörsdagsetning ekki tiltæk

source: Netgíró status updated: Transaction ID: %1$s. Status: %2$s. Refundable: %3$s. %4$s
is: Staða Netgíró uppfærð: Færslunúmer: %1$s. Staða: %2$s. Endurgreiðanlegt: %3$s. %4$s

source: Invalid response format from API server.
is: Ógilt snið svars frá API þjóni.

source: Pay with Netgíró.
is: Borga með Netgíró.

source: Accept payments via Netgíró.
is: Samþykkja greiðslur í gegnum Netgíró.

source: Netgíró signature mismatch.
is: Undirskrift Netgíró passar ekki.

source: Netgíró payment authorized. Please confirm this order by setting its status to Processing or Complete. Transaction ID: %1$s, %2$s
is: Netgíró greiðsla samþykkt. Vinsamlegast staðfestu þessa pöntun með því að breyta stöðu hennar í „Í vinnslu“ eða „Lokið“. Færslunúmer: %1$s, %2$s

source: Netgíró payment authorized and has been confirmed. Transaction ID: %1$s, Amount: %2$s
is: Netgíró greiðsla samþykkt og hefur verið staðfest. Færslunúmer: %1$s, Upphæð: %2$s

source: Could not attempt Netgíró confirmation: No transaction ID found.
is: Gekk ekki að reyna að staðfesta Netgíró greiðslu: Ekkert færslunúmer fannst.

source: Netgíró payment confirmed successfully.
is: Netgíró greiðsla staðfest.

source: Unknown error
is: Óþekkt villa

source: Netgíró manual confirmation failed. Reason: %s
is: Handvirk staðfesting Netgíró mistókst. Ástæða: %s

source: Order not found.
is: Pöntun fannst ekki.

source: Cannot refund: Missing Netgíró transaction ID.
is: Ekki hægt að endurgreiða: Vantar færslunúmer frá Netgíró.

source: Cannot refund: Payment is not in an authorized or confirmed state (Current state: %s).
is: Ekki hægt að endurgreiða: Greiðsla er ekki í samþykktu eða staðfestu ástandi (Núverandi ástand: %s).

source: Netgíró refund successful. Amount: %1$s
is: Endurgreiðsla í gegnum Netgíró tókst. Upphæð: %1$s

source: Unknown error during refund.
is: Óþekkt villa við endurgreiðslu.

source: Netgíró refund failed. Reason: %s
is: Endurgreiðsla í gegnum Netgíró mistókst. Ástæða: %s

source: Invalid order.
is: Ógild pöntun.

source: Order #%1$s from %2$s
is: Pöntun #%1$s frá %2$s

source: Please click the button below to proceed to Netgíró.
is: Vinsamlegast smelltu á hnappinn hér að neðan til að halda áfram í Netgíró.

source: Proceed to Netgíró
is: Halda áfram í Netgíró

source: Enable/Disable
is: Virkja/Afvirkja

source: Enable Netgíró Payment Gateway
is: Virkja Netgíró greiðslugátt

source: Title
is: Titill

source: This controls the title which the user sees during checkout.
is: Þetta stýrir titlinum sem notandinn sér við afgreiðslu.

source: Description
is: Lýsing

source: This controls the description which the user sees during checkout.
is: Þetta stýrir lýsingunni sem notandinn sér við afgreiðslu.

source: Pay securely using Netgíró. Choose instant payment, split payments, or invoice.
is: Borgaðu á öruggan hátt með Netgíró. Veldu straumgreiðslu, skiptar greiðslur eða reikning.

source: API Credentials
is: API aðgangsupplýsingar

source: Enter your Netgíró API details obtained from partner.netgiro.is.
is: Sláðu inn API upplýsingar þínar fyrir Netgíró sem þú fékkst frá partner.netgiro.is.

source: Test Mode
is: Prófunarumhverfi

source: Enable Netgíró Test Environment
is: Virkja prófunarumhverfi Netgíró

source: Use the Netgíró sandbox environment for testing. Requires separate test credentials.
is: Notaðu sandkassarumhverfi Netgíró til að prófa. Krefst sérstakra prófunar aðgangsupplýsinga.

source: Application ID
is: Auðkennisnúmer forrits

source: Enter your Netgíró Application ID.
is: Sláðu inn auðkennisnúmer forrits þíns fyrir Netgíró.

source: Secret Key
is: Leynilykill

source: Enter your Netgíró Secret Key.
is: Sláðu inn leynilykil þinn fyrir Netgíró.

source: Payment Options
is: Greiðslumöguleikar

source: Payment Confirmation Type
is: Tegund greiðslustaðfestingar

source: Choose how payments are confirmed after authorization. Automatic confirms immediately. Manual requires changing order status from On Hold to Processing/Completed.
is: Veldu hvernig greiðslur eru staðfestar eftir heimild. Sjálfvirk staðfestir strax. Handvirk krefst þess að pöntunarstaða sé breytt úr „Í bið“ í „Í vinnslu“/„Lokið“.

source: Automatic Confirmation (Capture immediately)
is: Sjálfvirk staðfesting (Tekur strax)

source: Manual Confirmation (Authorize now, Capture later)
is: Handvirk staðfesting (Heimilda núna, tekur seinna)

source: Send Order Item Details
is: Senda upplýsingar um vöruliði pöntunar

source: Send individual item details (product name, price, quantity) to Netgíró.
is: Senda upplýsingar um einstaka vörur (vöruheiti, verð, magn) til Netgíró.

source: Recommended. If unchecked, only the order total and a generic description will be sent.
is: Mælt með. Ef ekki hakað við, verður aðeins heildarupphæð pöntunar og almenn lýsing send.

source: Page Redirects
is: Síðutilvísanir

source: Cancel Page
is: Afbókunarsíða

source: Default (Checkout Page)
is: Sjálfgefið (Afgreiðslusíða)

source: Page where customers are redirected if they cancel the payment at Netgíró. If unset, defaults to the checkout page.
is: Síða þangað sem viðskiptavinum er vísað ef þeir hætta við greiðsluna hjá Netgíró. Ef ekki er stillt, er sjálfgefið afgreiðslusíðan.

source: Select a page
is: Veldu síðu

source: Netgíró Payment Gateway for WooCommerce requires WooCommerce to be installed and active.
is: Netgíró greiðslugátt fyrir WooCommerce krefst þess að WooCommerce sé uppsett og virkt.

source: Netgíró Payment Gateway requires WooCommerce currency to be set to ISK.
is: Netgíró greiðslugátt krefst þess að gjaldmiðill WooCommerce sé stilltur á ISK.
